esp8266/Arduino/boards.txt
##############################################################
modwifi.name=Olimex MOD-WIFI-ESP8266(-DEV)
modwifi.build.board=MOD_WIFI_ESP8266
modwifi.build.variant=modwifi
modwifi.upload.tool=esptool
modwifi.upload.maximum_data_size=81920
modwifi.upload.wait_for_upload_port=true
modwifi.upload.erase_cmd=
modwifi.serial.disableDTR=true
modwifi.serial.disableRTS=true
modwifi.build.mcu=esp8266
modwifi.build.core=esp8266
modwifi.build.spiffs_pagesize=256
modwifi.build.debug_port=
modwifi.build.debug_level=
modwifi.menu.xtal.80=80 MHz
modwifi.menu.xtal.80.build.f_cpu=80000000L
modwifi.menu.xtal.160=160 MHz
modwifi.menu.xtal.160.build.f_cpu=160000000L
modwifi.menu.vt.flash=Flash
modwifi.menu.vt.flash.build.vtable_flags=-DVTABLES_IN_FLASH
modwifi.menu.vt.heap=Heap
modwifi.menu.vt.heap.build.vtable_flags=-DVTABLES_IN_DRAM
modwifi.menu.vt.iram=IRAM
modwifi.menu.vt.iram.build.vtable_flags=-DVTABLES_IN_IRAM
modwifi.upload.resetmethod=ck
modwifi.build.flash_mode=qio
modwifi.build.flash_freq=40
modwifi.menu.eesz.2M=2M (no SPIFFS)
modwifi.menu.eesz.2M.build.flash_size=2M
modwifi.menu.eesz.2M.build.flash_size_bytes=0x200000
modwifi.menu.eesz.2M.build.flash_ld=eagle.flash.2m.ld
modwifi.menu.eesz.2M.build.spiffs_pagesize=256
modwifi.menu.eesz.2M.upload.maximum_size=1044464
modwifi.menu.eesz.2M.build.rfcal_addr=0x1FC000
modwifi.menu.eesz.2M512=2M (512K SPIFFS)
modwifi.menu.eesz.2M512.build.flash_size=2M
modwifi.menu.eesz.2M512.build.flash_size_bytes=0x200000
modwifi.menu.eesz.2M512.build.flash_ld=eagle.flash.2m512.ld
modwifi.menu.eesz.2M512.build.spiffs_pagesize=256
modwifi.menu.eesz.2M512.upload.maximum_size=1044464
modwifi.menu.eesz.2M512.build.rfcal_addr=0x1FC000
modwifi.menu.eesz.2M512.build.spiffs_start=0x180000
modwifi.menu.eesz.2M512.build.spiffs_end=0x1FB000
modwifi.menu.eesz.2M512.build.spiffs_blocksize=8192
modwifi.menu.eesz.2M1M=2M (1M SPIFFS)
modwifi.menu.eesz.2M1M.build.flash_size=2M
modwifi.menu.eesz.2M1M.build.flash_size_bytes=0x200000
modwifi.menu.eesz.2M1M.build.flash_ld=eagle.flash.2m1m.ld
modwifi.menu.eesz.2M1M.build.spiffs_pagesize=256
modwifi.menu.eesz.2M1M.upload.maximum_size=1044464
modwifi.menu.eesz.2M1M.build.rfcal_addr=0x1FC000
modwifi.menu.eesz.2M1M.build.spiffs_start=0x100000
modwifi.menu.eesz.2M1M.build.spiffs_end=0x1FB000
modwifi.menu.eesz.2M1M.build.spiffs_blocksize=8192
modwifi.menu.ip.lm2f=v2 Lower Memory
modwifi.menu.ip.lm2f.build.lwip_include=lwip2/include
modwifi.menu.ip.lm2f.build.lwip_lib=-llwip2-536-feat
modwifi.menu.ip.lm2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1
modwifi.menu.ip.hb2f=v2 Higher Bandwidth
modwifi.menu.ip.hb2f.build.lwip_include=lwip2/include
modwifi.menu.ip.hb2f.build.lwip_lib=-llwip2-1460-feat
modwifi.menu.ip.hb2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1
modwifi.menu.ip.lm2n=v2 Lower Memory (no features)
modwifi.menu.ip.lm2n.build.lwip_include=lwip2/include
modwifi.menu.ip.lm2n.build.lwip_lib=-llwip2-536
modwifi.menu.ip.lm2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=0
modwifi.menu.ip.hb2n=v2 Higher Bandwidth (no features)
modwifi.menu.ip.hb2n.build.lwip_include=lwip2/include
modwifi.menu.ip.hb2n.build.lwip_lib=-llwip2-1460
modwifi.menu.ip.hb2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=0
modwifi.menu.ip.hb1=v1.4 Higher Bandwidth
modwifi.menu.ip.hb1.build.lwip_lib=-llwip_gcc
modwifi.menu.ip.hb1.build.lwip_flags=-DLWIP_OPEN_SRC
modwifi.menu.ip.src=v1.4 Compile from source
modwifi.menu.ip.src.build.lwip_lib=-llwip_src
modwifi.menu.ip.src.build.lwip_flags=-DLWIP_OPEN_SRC
modwifi.menu.ip.src.recipe.hooks.sketch.prebuild.1.pattern=make -C "{runtime.platform.path}/tools/sdk/lwip/src" install TOOLS_PATH="{runtime.tools.xtensa-lx106-elf-gcc.path}/bin/xtensa-lx106-elf-"
modwifi.menu.dbg.Disabled=Disabled
modwifi.menu.dbg.Disabled.build.debug_port=
modwifi.menu.dbg.Serial=Serial
modwifi.menu.dbg.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
modwifi.menu.dbg.Serial1=Serial1
modwifi.menu.dbg.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1
modwifi.menu.lvl.None____=None
modwifi.menu.lvl.None____.build.debug_level=
modwifi.menu.lvl.SSL=SSL
modwifi.menu.lvl.SSL.build.debug_level= -DDEBUG_ESP_SSL
modwifi.menu.lvl.TLS_MEM=TLS_MEM
modwifi.menu.lvl.TLS_MEM.build.debug_level= -DDEBUG_ESP_TLS_MEM
modwifi.menu.lvl.HTTP_CLIENT=HTTP_CLIENT
modwifi.menu.lvl.HTTP_CLIENT.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT
modwifi.menu.lvl.HTTP_SERVER=HTTP_SERVER
modwifi.menu.lvl.HTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_SERVER
modwifi.menu.lvl.SSLTLS_MEM=SSL+TLS_MEM
modwifi.menu.lvl.SSLTLS_MEM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM
modwifi.menu.lvl.SSLHTTP_CLIENT=SSL+HTTP_CLIENT
modwifi.menu.lvl.SSLHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT
modwifi.menu.lvl.SSLHTTP_SERVER=SSL+HTTP_SERVER
modwifi.menu.lvl.SSLHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_SERVER
modwifi.menu.lvl.TLS_MEMHTTP_CLIENT=TLS_MEM+HTTP_CLIENT
modwifi.menu.lvl.TLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
modwifi.menu.lvl.TLS_MEMHTTP_SERVER=TLS_MEM+HTTP_SERVER
modwifi.menu.lvl.TLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
modwifi.menu.lvl.HTTP_CLIENTHTTP_SERVER=HTTP_CLIENT+HTTP_SERVER
modwifi.menu.lvl.HTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
modwifi.menu.lvl.SSLTLS_MEMHTTP_CLIENT=SSL+TLS_MEM+HTTP_CLIENT
modwifi.menu.lvl.SSLTLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
modwifi.menu.lvl.SSLTLS_MEMHTTP_SERVER=SSL+TLS_MEM+HTTP_SERVER
modwifi.menu.lvl.SSLTLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
modwifi.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER=SSL+HTTP_CLIENT+HTTP_SERVER
modwifi.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
modwifi.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER=TLS_MEM+HTTP_CLIENT+HTTP_SERVER
modwifi.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
modwifi.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER
modwifi.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
modwifi.menu.lvl.CORE=CORE
modwifi.menu.lvl.CORE.build.debug_level= -DDEBUG_ESP_CORE
modwifi.menu.lvl.WIFI=WIFI
modwifi.menu.lvl.WIFI.build.debug_level= -DDEBUG_ESP_WIFI
modwifi.menu.lvl.HTTP_UPDATE=HTTP_UPDATE
modwifi.menu.lvl.HTTP_UPDATE.build.debug_level= -DDEBUG_ESP_HTTP_UPDATE
modwifi.menu.lvl.UPDATER=UPDATER
modwifi.menu.lvl.UPDATER.build.debug_level= -DDEBUG_ESP_UPDATER
modwifi.menu.lvl.OTA=OTA
modwifi.menu.lvl.OTA.build.debug_level= -DDEBUG_ESP_OTA
modwifi.menu.lvl.OOM=OOM
modwifi.menu.lvl.OOM.build.debug_level= -DDEBUG_ESP_OOM
modwifi.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOM=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM
modwifi.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOM.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM
modwifi.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOM=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM
modwifi.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM
modwifi.menu.lvl.NoAssert-NDEBUG=NoAssert-NDEBUG
modwifi.menu.lvl.NoAssert-NDEBUG.build.debug_level= -DNDEBUG
modwifi.menu.wipe.none=Only Sketch
modwifi.menu.wipe.none.upload.erase_cmd=
modwifi.menu.wipe.sdk=Sketch + WiFi Settings
modwifi.menu.wipe.sdk.upload.erase_cmd=-ca "{build.rfcal_addr}" -cz 0x4000
modwifi.menu.wipe.all=All Flash Contents
modwifi.menu.wipe.all.upload.erase_cmd=-ca 0x0 -cz "{build.flash_size_bytes}"
modwifi.menu.baud.115200=115200
modwifi.menu.baud.115200.upload.speed=115200
modwifi.menu.baud.9600=9600
modwifi.menu.baud.9600.upload.speed=9600
modwifi.menu.baud.57600=57600
modwifi.menu.baud.57600.upload.speed=57600
modwifi.menu.baud.230400.linux=230400
modwifi.menu.baud.230400.macosx=230400
modwifi.menu.baud.230400.upload.speed=230400
modwifi.menu.baud.256000.windows=256000
modwifi.menu.baud.256000.upload.speed=256000
modwifi.menu.baud.460800.linux=460800
modwifi.menu.baud.460800.macosx=460800
modwifi.menu.baud.460800.upload.speed=460800
modwifi.menu.baud.512000.windows=512000
modwifi.menu.baud.512000.upload.speed=512000
modwifi.menu.baud.921600=921600
modwifi.menu.baud.921600.upload.speed=921600

