esp8266/Arduino/boards.txt
##############################################################
thing.name=SparkFun ESP8266 Thing
thing.build.board=ESP8266_THING
thing.build.variant=thing
thing.upload.tool=esptool
thing.upload.maximum_data_size=81920
thing.upload.wait_for_upload_port=true
thing.upload.erase_cmd=
thing.serial.disableDTR=true
thing.serial.disableRTS=true
thing.build.mcu=esp8266
thing.build.core=esp8266
thing.build.spiffs_pagesize=256
thing.build.debug_port=
thing.build.debug_level=
thing.menu.xtal.80=80 MHz
thing.menu.xtal.80.build.f_cpu=80000000L
thing.menu.xtal.160=160 MHz
thing.menu.xtal.160.build.f_cpu=160000000L
thing.menu.vt.flash=Flash
thing.menu.vt.flash.build.vtable_flags=-DVTABLES_IN_FLASH
thing.menu.vt.heap=Heap
thing.menu.vt.heap.build.vtable_flags=-DVTABLES_IN_DRAM
thing.menu.vt.iram=IRAM
thing.menu.vt.iram.build.vtable_flags=-DVTABLES_IN_IRAM
thing.upload.resetmethod=ck
thing.build.flash_mode=qio
thing.build.flash_freq=40
thing.menu.eesz.512K=512K (no SPIFFS)
thing.menu.eesz.512K.build.flash_size=512K
thing.menu.eesz.512K.build.flash_size_bytes=0x80000
thing.menu.eesz.512K.build.flash_ld=eagle.flash.512k.ld
thing.menu.eesz.512K.build.spiffs_pagesize=256
thing.menu.eesz.512K.upload.maximum_size=499696
thing.menu.eesz.512K.build.rfcal_addr=0x7C000
thing.menu.eesz.512K32=512K (32K SPIFFS)
thing.menu.eesz.512K32.build.flash_size=512K
thing.menu.eesz.512K32.build.flash_size_bytes=0x80000
thing.menu.eesz.512K32.build.flash_ld=eagle.flash.512k32.ld
thing.menu.eesz.512K32.build.spiffs_pagesize=256
thing.menu.eesz.512K32.upload.maximum_size=466928
thing.menu.eesz.512K32.build.rfcal_addr=0x7C000
thing.menu.eesz.512K32.build.spiffs_start=0x73000
thing.menu.eesz.512K32.build.spiffs_end=0x7B000
thing.menu.eesz.512K32.build.spiffs_blocksize=4096
thing.menu.eesz.512K64=512K (64K SPIFFS)
thing.menu.eesz.512K64.build.flash_size=512K
thing.menu.eesz.512K64.build.flash_size_bytes=0x80000
thing.menu.eesz.512K64.build.flash_ld=eagle.flash.512k64.ld
thing.menu.eesz.512K64.build.spiffs_pagesize=256
thing.menu.eesz.512K64.upload.maximum_size=434160
thing.menu.eesz.512K64.build.rfcal_addr=0x7C000
thing.menu.eesz.512K64.build.spiffs_start=0x6B000
thing.menu.eesz.512K64.build.spiffs_end=0x7B000
thing.menu.eesz.512K64.build.spiffs_blocksize=4096
thing.menu.eesz.512K128=512K (128K SPIFFS)
thing.menu.eesz.512K128.build.flash_size=512K
thing.menu.eesz.512K128.build.flash_size_bytes=0x80000
thing.menu.eesz.512K128.build.flash_ld=eagle.flash.512k128.ld
thing.menu.eesz.512K128.build.spiffs_pagesize=256
thing.menu.eesz.512K128.upload.maximum_size=368624
thing.menu.eesz.512K128.build.rfcal_addr=0x7C000
thing.menu.eesz.512K128.build.spiffs_start=0x5B000
thing.menu.eesz.512K128.build.spiffs_end=0x7B000
thing.menu.eesz.512K128.build.spiffs_blocksize=4096
thing.menu.ip.lm2f=v2 Lower Memory
thing.menu.ip.lm2f.build.lwip_include=lwip2/include
thing.menu.ip.lm2f.build.lwip_lib=-llwip2-536-feat
thing.menu.ip.lm2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1
thing.menu.ip.hb2f=v2 Higher Bandwidth
thing.menu.ip.hb2f.build.lwip_include=lwip2/include
thing.menu.ip.hb2f.build.lwip_lib=-llwip2-1460-feat
thing.menu.ip.hb2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1
thing.menu.ip.lm2n=v2 Lower Memory (no features)
thing.menu.ip.lm2n.build.lwip_include=lwip2/include
thing.menu.ip.lm2n.build.lwip_lib=-llwip2-536
thing.menu.ip.lm2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=0
thing.menu.ip.hb2n=v2 Higher Bandwidth (no features)
thing.menu.ip.hb2n.build.lwip_include=lwip2/include
thing.menu.ip.hb2n.build.lwip_lib=-llwip2-1460
thing.menu.ip.hb2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=0
thing.menu.ip.hb1=v1.4 Higher Bandwidth
thing.menu.ip.hb1.build.lwip_lib=-llwip_gcc
thing.menu.ip.hb1.build.lwip_flags=-DLWIP_OPEN_SRC
thing.menu.ip.src=v1.4 Compile from source
thing.menu.ip.src.build.lwip_lib=-llwip_src
thing.menu.ip.src.build.lwip_flags=-DLWIP_OPEN_SRC
thing.menu.ip.src.recipe.hooks.sketch.prebuild.1.pattern=make -C "{runtime.platform.path}/tools/sdk/lwip/src" install TOOLS_PATH="{runtime.tools.xtensa-lx106-elf-gcc.path}/bin/xtensa-lx106-elf-"
thing.menu.dbg.Disabled=Disabled
thing.menu.dbg.Disabled.build.debug_port=
thing.menu.dbg.Serial=Serial
thing.menu.dbg.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
thing.menu.dbg.Serial1=Serial1
thing.menu.dbg.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1
thing.menu.lvl.None____=None
thing.menu.lvl.None____.build.debug_level=
thing.menu.lvl.SSL=SSL
thing.menu.lvl.SSL.build.debug_level= -DDEBUG_ESP_SSL
thing.menu.lvl.TLS_MEM=TLS_MEM
thing.menu.lvl.TLS_MEM.build.debug_level= -DDEBUG_ESP_TLS_MEM
thing.menu.lvl.HTTP_CLIENT=HTTP_CLIENT
thing.menu.lvl.HTTP_CLIENT.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT
thing.menu.lvl.HTTP_SERVER=HTTP_SERVER
thing.menu.lvl.HTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_SERVER
thing.menu.lvl.SSLTLS_MEM=SSL+TLS_MEM
thing.menu.lvl.SSLTLS_MEM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM
thing.menu.lvl.SSLHTTP_CLIENT=SSL+HTTP_CLIENT
thing.menu.lvl.SSLHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT
thing.menu.lvl.SSLHTTP_SERVER=SSL+HTTP_SERVER
thing.menu.lvl.SSLHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_SERVER
thing.menu.lvl.TLS_MEMHTTP_CLIENT=TLS_MEM+HTTP_CLIENT
thing.menu.lvl.TLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
thing.menu.lvl.TLS_MEMHTTP_SERVER=TLS_MEM+HTTP_SERVER
thing.menu.lvl.TLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
thing.menu.lvl.HTTP_CLIENTHTTP_SERVER=HTTP_CLIENT+HTTP_SERVER
thing.menu.lvl.HTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
thing.menu.lvl.SSLTLS_MEMHTTP_CLIENT=SSL+TLS_MEM+HTTP_CLIENT
thing.menu.lvl.SSLTLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
thing.menu.lvl.SSLTLS_MEMHTTP_SERVER=SSL+TLS_MEM+HTTP_SERVER
thing.menu.lvl.SSLTLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
thing.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER=SSL+HTTP_CLIENT+HTTP_SERVER
thing.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
thing.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER=TLS_MEM+HTTP_CLIENT+HTTP_SERVER
thing.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
thing.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER
thing.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
thing.menu.lvl.CORE=CORE
thing.menu.lvl.CORE.build.debug_level= -DDEBUG_ESP_CORE
thing.menu.lvl.WIFI=WIFI
thing.menu.lvl.WIFI.build.debug_level= -DDEBUG_ESP_WIFI
thing.menu.lvl.HTTP_UPDATE=HTTP_UPDATE
thing.menu.lvl.HTTP_UPDATE.build.debug_level= -DDEBUG_ESP_HTTP_UPDATE
thing.menu.lvl.UPDATER=UPDATER
thing.menu.lvl.UPDATER.build.debug_level= -DDEBUG_ESP_UPDATER
thing.menu.lvl.OTA=OTA
thing.menu.lvl.OTA.build.debug_level= -DDEBUG_ESP_OTA
thing.menu.lvl.OOM=OOM
thing.menu.lvl.OOM.build.debug_level= -DDEBUG_ESP_OOM
thing.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOM=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM
thing.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOM.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM
thing.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOM=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM
thing.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM
thing.menu.lvl.NoAssert-NDEBUG=NoAssert-NDEBUG
thing.menu.lvl.NoAssert-NDEBUG.build.debug_level= -DNDEBUG
thing.menu.wipe.none=Only Sketch
thing.menu.wipe.none.upload.erase_cmd=
thing.menu.wipe.sdk=Sketch + WiFi Settings
thing.menu.wipe.sdk.upload.erase_cmd=-ca "{build.rfcal_addr}" -cz 0x4000
thing.menu.wipe.all=All Flash Contents
thing.menu.wipe.all.upload.erase_cmd=-ca 0x0 -cz "{build.flash_size_bytes}"
thing.menu.baud.115200=115200
thing.menu.baud.115200.upload.speed=115200
thing.menu.baud.9600=9600
thing.menu.baud.9600.upload.speed=9600
thing.menu.baud.57600=57600
thing.menu.baud.57600.upload.speed=57600
thing.menu.baud.230400.linux=230400
thing.menu.baud.230400.macosx=230400
thing.menu.baud.230400.upload.speed=230400
thing.menu.baud.256000.windows=256000
thing.menu.baud.256000.upload.speed=256000
thing.menu.baud.460800.linux=460800
thing.menu.baud.460800.macosx=460800
thing.menu.baud.460800.upload.speed=460800
thing.menu.baud.512000.windows=512000
thing.menu.baud.512000.upload.speed=512000
thing.menu.baud.921600=921600
thing.menu.baud.921600.upload.speed=921600

