esp8266/Arduino/boards.txt
##############################################################
esp210.name=SweetPea ESP-210
esp210.build.board=ESP8266_ESP210
esp210.upload.tool=esptool
esp210.upload.maximum_data_size=81920
esp210.upload.wait_for_upload_port=true
esp210.upload.erase_cmd=
esp210.serial.disableDTR=true
esp210.serial.disableRTS=true
esp210.build.mcu=esp8266
esp210.build.core=esp8266
esp210.build.variant=generic
esp210.build.spiffs_pagesize=256
esp210.build.debug_port=
esp210.build.debug_level=
esp210.menu.xtal.80=80 MHz
esp210.menu.xtal.80.build.f_cpu=80000000L
esp210.menu.xtal.160=160 MHz
esp210.menu.xtal.160.build.f_cpu=160000000L
esp210.menu.vt.flash=Flash
esp210.menu.vt.flash.build.vtable_flags=-DVTABLES_IN_FLASH
esp210.menu.vt.heap=Heap
esp210.menu.vt.heap.build.vtable_flags=-DVTABLES_IN_DRAM
esp210.menu.vt.iram=IRAM
esp210.menu.vt.iram.build.vtable_flags=-DVTABLES_IN_IRAM
esp210.upload.resetmethod=ck
esp210.build.flash_mode=qio
esp210.build.flash_freq=40
esp210.menu.eesz.4M=4M (no SPIFFS)
esp210.menu.eesz.4M.build.flash_size=4M
esp210.menu.eesz.4M.build.flash_size_bytes=0x400000
esp210.menu.eesz.4M.build.flash_ld=eagle.flash.4m.ld
esp210.menu.eesz.4M.build.spiffs_pagesize=256
esp210.menu.eesz.4M.upload.maximum_size=1044464
esp210.menu.eesz.4M.build.rfcal_addr=0x3FC000
esp210.menu.eesz.4M1M=4M (1M SPIFFS)
esp210.menu.eesz.4M1M.build.flash_size=4M
esp210.menu.eesz.4M1M.build.flash_size_bytes=0x400000
esp210.menu.eesz.4M1M.build.flash_ld=eagle.flash.4m1m.ld
esp210.menu.eesz.4M1M.build.spiffs_pagesize=256
esp210.menu.eesz.4M1M.upload.maximum_size=1044464
esp210.menu.eesz.4M1M.build.rfcal_addr=0x3FC000
esp210.menu.eesz.4M1M.build.spiffs_start=0x300000
esp210.menu.eesz.4M1M.build.spiffs_end=0x3FB000
esp210.menu.eesz.4M1M.build.spiffs_blocksize=8192
esp210.menu.eesz.4M2M=4M (2M SPIFFS)
esp210.menu.eesz.4M2M.build.flash_size=4M
esp210.menu.eesz.4M2M.build.flash_size_bytes=0x400000
esp210.menu.eesz.4M2M.build.flash_ld=eagle.flash.4m2m.ld
esp210.menu.eesz.4M2M.build.spiffs_pagesize=256
esp210.menu.eesz.4M2M.upload.maximum_size=1044464
esp210.menu.eesz.4M2M.build.rfcal_addr=0x3FC000
esp210.menu.eesz.4M2M.build.spiffs_start=0x200000
esp210.menu.eesz.4M2M.build.spiffs_end=0x3FB000
esp210.menu.eesz.4M2M.build.spiffs_blocksize=8192
esp210.menu.eesz.4M3M=4M (3M SPIFFS)
esp210.menu.eesz.4M3M.build.flash_size=4M
esp210.menu.eesz.4M3M.build.flash_size_bytes=0x400000
esp210.menu.eesz.4M3M.build.flash_ld=eagle.flash.4m3m.ld
esp210.menu.eesz.4M3M.build.spiffs_pagesize=256
esp210.menu.eesz.4M3M.upload.maximum_size=1044464
esp210.menu.eesz.4M3M.build.rfcal_addr=0x3FC000
esp210.menu.eesz.4M3M.build.spiffs_start=0x100000
esp210.menu.eesz.4M3M.build.spiffs_end=0x3FB000
esp210.menu.eesz.4M3M.build.spiffs_blocksize=8192
esp210.menu.ip.lm2f=v2 Lower Memory
esp210.menu.ip.lm2f.build.lwip_include=lwip2/include
esp210.menu.ip.lm2f.build.lwip_lib=-llwip2-536-feat
esp210.menu.ip.lm2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1
esp210.menu.ip.hb2f=v2 Higher Bandwidth
esp210.menu.ip.hb2f.build.lwip_include=lwip2/include
esp210.menu.ip.hb2f.build.lwip_lib=-llwip2-1460-feat
esp210.menu.ip.hb2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1
esp210.menu.ip.lm2n=v2 Lower Memory (no features)
esp210.menu.ip.lm2n.build.lwip_include=lwip2/include
esp210.menu.ip.lm2n.build.lwip_lib=-llwip2-536
esp210.menu.ip.lm2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=0
esp210.menu.ip.hb2n=v2 Higher Bandwidth (no features)
esp210.menu.ip.hb2n.build.lwip_include=lwip2/include
esp210.menu.ip.hb2n.build.lwip_lib=-llwip2-1460
esp210.menu.ip.hb2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=0
esp210.menu.ip.hb1=v1.4 Higher Bandwidth
esp210.menu.ip.hb1.build.lwip_lib=-llwip_gcc
esp210.menu.ip.hb1.build.lwip_flags=-DLWIP_OPEN_SRC
esp210.menu.ip.src=v1.4 Compile from source
esp210.menu.ip.src.build.lwip_lib=-llwip_src
esp210.menu.ip.src.build.lwip_flags=-DLWIP_OPEN_SRC
esp210.menu.ip.src.recipe.hooks.sketch.prebuild.1.pattern=make -C "{runtime.platform.path}/tools/sdk/lwip/src" install TOOLS_PATH="{runtime.tools.xtensa-lx106-elf-gcc.path}/bin/xtensa-lx106-elf-"
esp210.menu.dbg.Disabled=Disabled
esp210.menu.dbg.Disabled.build.debug_port=
esp210.menu.dbg.Serial=Serial
esp210.menu.dbg.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
esp210.menu.dbg.Serial1=Serial1
esp210.menu.dbg.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1
esp210.menu.lvl.None____=None
esp210.menu.lvl.None____.build.debug_level=
esp210.menu.lvl.SSL=SSL
esp210.menu.lvl.SSL.build.debug_level= -DDEBUG_ESP_SSL
esp210.menu.lvl.TLS_MEM=TLS_MEM
esp210.menu.lvl.TLS_MEM.build.debug_level= -DDEBUG_ESP_TLS_MEM
esp210.menu.lvl.HTTP_CLIENT=HTTP_CLIENT
esp210.menu.lvl.HTTP_CLIENT.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT
esp210.menu.lvl.HTTP_SERVER=HTTP_SERVER
esp210.menu.lvl.HTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_SERVER
esp210.menu.lvl.SSLTLS_MEM=SSL+TLS_MEM
esp210.menu.lvl.SSLTLS_MEM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM
esp210.menu.lvl.SSLHTTP_CLIENT=SSL+HTTP_CLIENT
esp210.menu.lvl.SSLHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT
esp210.menu.lvl.SSLHTTP_SERVER=SSL+HTTP_SERVER
esp210.menu.lvl.SSLHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_SERVER
esp210.menu.lvl.TLS_MEMHTTP_CLIENT=TLS_MEM+HTTP_CLIENT
esp210.menu.lvl.TLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
esp210.menu.lvl.TLS_MEMHTTP_SERVER=TLS_MEM+HTTP_SERVER
esp210.menu.lvl.TLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
esp210.menu.lvl.HTTP_CLIENTHTTP_SERVER=HTTP_CLIENT+HTTP_SERVER
esp210.menu.lvl.HTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
esp210.menu.lvl.SSLTLS_MEMHTTP_CLIENT=SSL+TLS_MEM+HTTP_CLIENT
esp210.menu.lvl.SSLTLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
esp210.menu.lvl.SSLTLS_MEMHTTP_SERVER=SSL+TLS_MEM+HTTP_SERVER
esp210.menu.lvl.SSLTLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
esp210.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER=SSL+HTTP_CLIENT+HTTP_SERVER
esp210.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
esp210.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER=TLS_MEM+HTTP_CLIENT+HTTP_SERVER
esp210.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
esp210.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER
esp210.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
esp210.menu.lvl.CORE=CORE
esp210.menu.lvl.CORE.build.debug_level= -DDEBUG_ESP_CORE
esp210.menu.lvl.WIFI=WIFI
esp210.menu.lvl.WIFI.build.debug_level= -DDEBUG_ESP_WIFI
esp210.menu.lvl.HTTP_UPDATE=HTTP_UPDATE
esp210.menu.lvl.HTTP_UPDATE.build.debug_level= -DDEBUG_ESP_HTTP_UPDATE
esp210.menu.lvl.UPDATER=UPDATER
esp210.menu.lvl.UPDATER.build.debug_level= -DDEBUG_ESP_UPDATER
esp210.menu.lvl.OTA=OTA
esp210.menu.lvl.OTA.build.debug_level= -DDEBUG_ESP_OTA
esp210.menu.lvl.OOM=OOM
esp210.menu.lvl.OOM.build.debug_level= -DDEBUG_ESP_OOM
esp210.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOM=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM
esp210.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOM.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM
esp210.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOM=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM
esp210.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM
esp210.menu.lvl.NoAssert-NDEBUG=NoAssert-NDEBUG
esp210.menu.lvl.NoAssert-NDEBUG.build.debug_level= -DNDEBUG
esp210.menu.wipe.none=Only Sketch
esp210.menu.wipe.none.upload.erase_cmd=
esp210.menu.wipe.sdk=Sketch + WiFi Settings
esp210.menu.wipe.sdk.upload.erase_cmd=-ca "{build.rfcal_addr}" -cz 0x4000
esp210.menu.wipe.all=All Flash Contents
esp210.menu.wipe.all.upload.erase_cmd=-ca 0x0 -cz "{build.flash_size_bytes}"
esp210.menu.baud.57600=57600
esp210.menu.baud.57600.upload.speed=57600
esp210.menu.baud.9600=9600
esp210.menu.baud.9600.upload.speed=9600
esp210.menu.baud.115200=115200
esp210.menu.baud.115200.upload.speed=115200
esp210.menu.baud.230400.linux=230400
esp210.menu.baud.230400.macosx=230400
esp210.menu.baud.230400.upload.speed=230400
esp210.menu.baud.256000.windows=256000
esp210.menu.baud.256000.upload.speed=256000
esp210.menu.baud.460800.linux=460800
esp210.menu.baud.460800.macosx=460800
esp210.menu.baud.460800.upload.speed=460800
esp210.menu.baud.512000.windows=512000
esp210.menu.baud.512000.upload.speed=512000
esp210.menu.baud.921600=921600
esp210.menu.baud.921600.upload.speed=921600

