esp8266/Arduino/boards.txt
##############################################################
d1_mini_lite.name=LOLIN(WEMOS) D1 mini Lite
d1_mini_lite.build.board=ESP8266_WEMOS_D1MINILITE
d1_mini_lite.build.variant=d1_mini
d1_mini_lite.upload.tool=esptool
d1_mini_lite.upload.maximum_data_size=81920
d1_mini_lite.upload.wait_for_upload_port=true
d1_mini_lite.upload.erase_cmd=
d1_mini_lite.serial.disableDTR=true
d1_mini_lite.serial.disableRTS=true
d1_mini_lite.build.mcu=esp8266
d1_mini_lite.build.core=esp8266
d1_mini_lite.build.spiffs_pagesize=256
d1_mini_lite.build.debug_port=
d1_mini_lite.build.debug_level=
d1_mini_lite.menu.xtal.80=80 MHz
d1_mini_lite.menu.xtal.80.build.f_cpu=80000000L
d1_mini_lite.menu.xtal.160=160 MHz
d1_mini_lite.menu.xtal.160.build.f_cpu=160000000L
d1_mini_lite.menu.vt.flash=Flash
d1_mini_lite.menu.vt.flash.build.vtable_flags=-DVTABLES_IN_FLASH
d1_mini_lite.menu.vt.heap=Heap
d1_mini_lite.menu.vt.heap.build.vtable_flags=-DVTABLES_IN_DRAM
d1_mini_lite.menu.vt.iram=IRAM
d1_mini_lite.menu.vt.iram.build.vtable_flags=-DVTABLES_IN_IRAM
d1_mini_lite.upload.resetmethod=nodemcu
d1_mini_lite.build.flash_mode=dout
d1_mini_lite.build.flash_freq=40
d1_mini_lite.menu.eesz.1M=1M (no SPIFFS)
d1_mini_lite.menu.eesz.1M.build.flash_size=1M
d1_mini_lite.menu.eesz.1M.build.flash_size_bytes=0x100000
d1_mini_lite.menu.eesz.1M.build.flash_ld=eagle.flash.1m.ld
d1_mini_lite.menu.eesz.1M.build.spiffs_pagesize=256
d1_mini_lite.menu.eesz.1M.upload.maximum_size=1023984
d1_mini_lite.menu.eesz.1M.build.rfcal_addr=0xFC000
d1_mini_lite.menu.eesz.1M64=1M (64K SPIFFS)
d1_mini_lite.menu.eesz.1M64.build.flash_size=1M
d1_mini_lite.menu.eesz.1M64.build.flash_size_bytes=0x100000
d1_mini_lite.menu.eesz.1M64.build.flash_ld=eagle.flash.1m64.ld
d1_mini_lite.menu.eesz.1M64.build.spiffs_pagesize=256
d1_mini_lite.menu.eesz.1M64.upload.maximum_size=958448
d1_mini_lite.menu.eesz.1M64.build.rfcal_addr=0xFC000
d1_mini_lite.menu.eesz.1M64.build.spiffs_start=0xEB000
d1_mini_lite.menu.eesz.1M64.build.spiffs_end=0xFB000
d1_mini_lite.menu.eesz.1M64.build.spiffs_blocksize=4096
d1_mini_lite.menu.eesz.1M128=1M (128K SPIFFS)
d1_mini_lite.menu.eesz.1M128.build.flash_size=1M
d1_mini_lite.menu.eesz.1M128.build.flash_size_bytes=0x100000
d1_mini_lite.menu.eesz.1M128.build.flash_ld=eagle.flash.1m128.ld
d1_mini_lite.menu.eesz.1M128.build.spiffs_pagesize=256
d1_mini_lite.menu.eesz.1M128.upload.maximum_size=892912
d1_mini_lite.menu.eesz.1M128.build.rfcal_addr=0xFC000
d1_mini_lite.menu.eesz.1M128.build.spiffs_start=0xDB000
d1_mini_lite.menu.eesz.1M128.build.spiffs_end=0xFB000
d1_mini_lite.menu.eesz.1M128.build.spiffs_blocksize=4096
d1_mini_lite.menu.eesz.1M144=1M (144K SPIFFS)
d1_mini_lite.menu.eesz.1M144.build.flash_size=1M
d1_mini_lite.menu.eesz.1M144.build.flash_size_bytes=0x100000
d1_mini_lite.menu.eesz.1M144.build.flash_ld=eagle.flash.1m144.ld
d1_mini_lite.menu.eesz.1M144.build.spiffs_pagesize=256
d1_mini_lite.menu.eesz.1M144.upload.maximum_size=876528
d1_mini_lite.menu.eesz.1M144.build.rfcal_addr=0xFC000
d1_mini_lite.menu.eesz.1M144.build.spiffs_start=0xD7000
d1_mini_lite.menu.eesz.1M144.build.spiffs_end=0xFB000
d1_mini_lite.menu.eesz.1M144.build.spiffs_blocksize=4096
d1_mini_lite.menu.eesz.1M160=1M (160K SPIFFS)
d1_mini_lite.menu.eesz.1M160.build.flash_size=1M
d1_mini_lite.menu.eesz.1M160.build.flash_size_bytes=0x100000
d1_mini_lite.menu.eesz.1M160.build.flash_ld=eagle.flash.1m160.ld
d1_mini_lite.menu.eesz.1M160.build.spiffs_pagesize=256
d1_mini_lite.menu.eesz.1M160.upload.maximum_size=860144
d1_mini_lite.menu.eesz.1M160.build.rfcal_addr=0xFC000
d1_mini_lite.menu.eesz.1M160.build.spiffs_start=0xD3000
d1_mini_lite.menu.eesz.1M160.build.spiffs_end=0xFB000
d1_mini_lite.menu.eesz.1M160.build.spiffs_blocksize=4096
d1_mini_lite.menu.eesz.1M192=1M (192K SPIFFS)
d1_mini_lite.menu.eesz.1M192.build.flash_size=1M
d1_mini_lite.menu.eesz.1M192.build.flash_size_bytes=0x100000
d1_mini_lite.menu.eesz.1M192.build.flash_ld=eagle.flash.1m192.ld
d1_mini_lite.menu.eesz.1M192.build.spiffs_pagesize=256
d1_mini_lite.menu.eesz.1M192.upload.maximum_size=827376
d1_mini_lite.menu.eesz.1M192.build.rfcal_addr=0xFC000
d1_mini_lite.menu.eesz.1M192.build.spiffs_start=0xCB000
d1_mini_lite.menu.eesz.1M192.build.spiffs_end=0xFB000
d1_mini_lite.menu.eesz.1M192.build.spiffs_blocksize=4096
d1_mini_lite.menu.eesz.1M256=1M (256K SPIFFS)
d1_mini_lite.menu.eesz.1M256.build.flash_size=1M
d1_mini_lite.menu.eesz.1M256.build.flash_size_bytes=0x100000
d1_mini_lite.menu.eesz.1M256.build.flash_ld=eagle.flash.1m256.ld
d1_mini_lite.menu.eesz.1M256.build.spiffs_pagesize=256
d1_mini_lite.menu.eesz.1M256.upload.maximum_size=761840
d1_mini_lite.menu.eesz.1M256.build.rfcal_addr=0xFC000
d1_mini_lite.menu.eesz.1M256.build.spiffs_start=0xBB000
d1_mini_lite.menu.eesz.1M256.build.spiffs_end=0xFB000
d1_mini_lite.menu.eesz.1M256.build.spiffs_blocksize=4096
d1_mini_lite.menu.eesz.1M512=1M (512K SPIFFS)
d1_mini_lite.menu.eesz.1M512.build.flash_size=1M
d1_mini_lite.menu.eesz.1M512.build.flash_size_bytes=0x100000
d1_mini_lite.menu.eesz.1M512.build.flash_ld=eagle.flash.1m512.ld
d1_mini_lite.menu.eesz.1M512.build.spiffs_pagesize=256
d1_mini_lite.menu.eesz.1M512.upload.maximum_size=499696
d1_mini_lite.menu.eesz.1M512.build.rfcal_addr=0xFC000
d1_mini_lite.menu.eesz.1M512.build.spiffs_start=0x7B000
d1_mini_lite.menu.eesz.1M512.build.spiffs_end=0xFB000
d1_mini_lite.menu.eesz.1M512.build.spiffs_blocksize=4096
d1_mini_lite.menu.ip.lm2f=v2 Lower Memory
d1_mini_lite.menu.ip.lm2f.build.lwip_include=lwip2/include
d1_mini_lite.menu.ip.lm2f.build.lwip_lib=-llwip2-536-feat
d1_mini_lite.menu.ip.lm2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1
d1_mini_lite.menu.ip.hb2f=v2 Higher Bandwidth
d1_mini_lite.menu.ip.hb2f.build.lwip_include=lwip2/include
d1_mini_lite.menu.ip.hb2f.build.lwip_lib=-llwip2-1460-feat
d1_mini_lite.menu.ip.hb2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1
d1_mini_lite.menu.ip.lm2n=v2 Lower Memory (no features)
d1_mini_lite.menu.ip.lm2n.build.lwip_include=lwip2/include
d1_mini_lite.menu.ip.lm2n.build.lwip_lib=-llwip2-536
d1_mini_lite.menu.ip.lm2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=0
d1_mini_lite.menu.ip.hb2n=v2 Higher Bandwidth (no features)
d1_mini_lite.menu.ip.hb2n.build.lwip_include=lwip2/include
d1_mini_lite.menu.ip.hb2n.build.lwip_lib=-llwip2-1460
d1_mini_lite.menu.ip.hb2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=0
d1_mini_lite.menu.ip.hb1=v1.4 Higher Bandwidth
d1_mini_lite.menu.ip.hb1.build.lwip_lib=-llwip_gcc
d1_mini_lite.menu.ip.hb1.build.lwip_flags=-DLWIP_OPEN_SRC
d1_mini_lite.menu.ip.src=v1.4 Compile from source
d1_mini_lite.menu.ip.src.build.lwip_lib=-llwip_src
d1_mini_lite.menu.ip.src.build.lwip_flags=-DLWIP_OPEN_SRC
d1_mini_lite.menu.ip.src.recipe.hooks.sketch.prebuild.1.pattern=make -C "{runtime.platform.path}/tools/sdk/lwip/src" install TOOLS_PATH="{runtime.tools.xtensa-lx106-elf-gcc.path}/bin/xtensa-lx106-elf-"
d1_mini_lite.menu.dbg.Disabled=Disabled
d1_mini_lite.menu.dbg.Disabled.build.debug_port=
d1_mini_lite.menu.dbg.Serial=Serial
d1_mini_lite.menu.dbg.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
d1_mini_lite.menu.dbg.Serial1=Serial1
d1_mini_lite.menu.dbg.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1
d1_mini_lite.menu.lvl.None____=None
d1_mini_lite.menu.lvl.None____.build.debug_level=
d1_mini_lite.menu.lvl.SSL=SSL
d1_mini_lite.menu.lvl.SSL.build.debug_level= -DDEBUG_ESP_SSL
d1_mini_lite.menu.lvl.TLS_MEM=TLS_MEM
d1_mini_lite.menu.lvl.TLS_MEM.build.debug_level= -DDEBUG_ESP_TLS_MEM
d1_mini_lite.menu.lvl.HTTP_CLIENT=HTTP_CLIENT
d1_mini_lite.menu.lvl.HTTP_CLIENT.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT
d1_mini_lite.menu.lvl.HTTP_SERVER=HTTP_SERVER
d1_mini_lite.menu.lvl.HTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_SERVER
d1_mini_lite.menu.lvl.SSLTLS_MEM=SSL+TLS_MEM
d1_mini_lite.menu.lvl.SSLTLS_MEM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM
d1_mini_lite.menu.lvl.SSLHTTP_CLIENT=SSL+HTTP_CLIENT
d1_mini_lite.menu.lvl.SSLHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT
d1_mini_lite.menu.lvl.SSLHTTP_SERVER=SSL+HTTP_SERVER
d1_mini_lite.menu.lvl.SSLHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_SERVER
d1_mini_lite.menu.lvl.TLS_MEMHTTP_CLIENT=TLS_MEM+HTTP_CLIENT
d1_mini_lite.menu.lvl.TLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
d1_mini_lite.menu.lvl.TLS_MEMHTTP_SERVER=TLS_MEM+HTTP_SERVER
d1_mini_lite.menu.lvl.TLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
d1_mini_lite.menu.lvl.HTTP_CLIENTHTTP_SERVER=HTTP_CLIENT+HTTP_SERVER
d1_mini_lite.menu.lvl.HTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
d1_mini_lite.menu.lvl.SSLTLS_MEMHTTP_CLIENT=SSL+TLS_MEM+HTTP_CLIENT
d1_mini_lite.menu.lvl.SSLTLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
d1_mini_lite.menu.lvl.SSLTLS_MEMHTTP_SERVER=SSL+TLS_MEM+HTTP_SERVER
d1_mini_lite.menu.lvl.SSLTLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
d1_mini_lite.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER=SSL+HTTP_CLIENT+HTTP_SERVER
d1_mini_lite.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
d1_mini_lite.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER=TLS_MEM+HTTP_CLIENT+HTTP_SERVER
d1_mini_lite.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
d1_mini_lite.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER
d1_mini_lite.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
d1_mini_lite.menu.lvl.CORE=CORE
d1_mini_lite.menu.lvl.CORE.build.debug_level= -DDEBUG_ESP_CORE
d1_mini_lite.menu.lvl.WIFI=WIFI
d1_mini_lite.menu.lvl.WIFI.build.debug_level= -DDEBUG_ESP_WIFI
d1_mini_lite.menu.lvl.HTTP_UPDATE=HTTP_UPDATE
d1_mini_lite.menu.lvl.HTTP_UPDATE.build.debug_level= -DDEBUG_ESP_HTTP_UPDATE
d1_mini_lite.menu.lvl.UPDATER=UPDATER
d1_mini_lite.menu.lvl.UPDATER.build.debug_level= -DDEBUG_ESP_UPDATER
d1_mini_lite.menu.lvl.OTA=OTA
d1_mini_lite.menu.lvl.OTA.build.debug_level= -DDEBUG_ESP_OTA
d1_mini_lite.menu.lvl.OOM=OOM
d1_mini_lite.menu.lvl.OOM.build.debug_level= -DDEBUG_ESP_OOM
d1_mini_lite.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOM=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM
d1_mini_lite.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOM.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM
d1_mini_lite.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOM=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM
d1_mini_lite.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM
d1_mini_lite.menu.lvl.NoAssert-NDEBUG=NoAssert-NDEBUG
d1_mini_lite.menu.lvl.NoAssert-NDEBUG.build.debug_level= -DNDEBUG
d1_mini_lite.menu.wipe.none=Only Sketch
d1_mini_lite.menu.wipe.none.upload.erase_cmd=
d1_mini_lite.menu.wipe.sdk=Sketch + WiFi Settings
d1_mini_lite.menu.wipe.sdk.upload.erase_cmd=-ca "{build.rfcal_addr}" -cz 0x4000
d1_mini_lite.menu.wipe.all=All Flash Contents
d1_mini_lite.menu.wipe.all.upload.erase_cmd=-ca 0x0 -cz "{build.flash_size_bytes}"
d1_mini_lite.menu.baud.921600=921600
d1_mini_lite.menu.baud.921600.upload.speed=921600
d1_mini_lite.menu.baud.9600=9600
d1_mini_lite.menu.baud.9600.upload.speed=9600
d1_mini_lite.menu.baud.57600=57600
d1_mini_lite.menu.baud.57600.upload.speed=57600
d1_mini_lite.menu.baud.115200=115200
d1_mini_lite.menu.baud.115200.upload.speed=115200
d1_mini_lite.menu.baud.230400.linux=230400
d1_mini_lite.menu.baud.230400.macosx=230400
d1_mini_lite.menu.baud.230400.upload.speed=230400
d1_mini_lite.menu.baud.256000.windows=256000
d1_mini_lite.menu.baud.256000.upload.speed=256000
d1_mini_lite.menu.baud.460800.linux=460800
d1_mini_lite.menu.baud.460800.macosx=460800
d1_mini_lite.menu.baud.460800.upload.speed=460800
d1_mini_lite.menu.baud.512000.windows=512000
d1_mini_lite.menu.baud.512000.upload.speed=512000

